[
{"id": "004", "description": "Griffith College – aerial view from 1991."},
{"id": "006", "description": "Professor Diarmuid Hegarty President of Griffth College Dublin "},
{"id": "008", "description": "Drawing of Daniel O’Connell and the Repeal Martyrs’ release and procession from The Richmond Bridewell, 1844. (Courtesy of the National Library of Ireland)"},
{"id": "009", "description": "An Ordnance Survey map of 1837 shows the Richmond Bridewell. (Ordnance Survey Ireland Government of Ireland)"},
{"id": "010", "description": "A fragment of the original drawings by the architect Francis Johnston, dated 1813.  (Courtesy of the Irish Architectural Archive)"},
{"id": "011", "description": "a commemorative coin with the profile of Francis Johnston.  (Courtesy of the National Library of Ireland)"},
{"id": "012", "description": "“Richmond Bridewell, late prison of O’Connell and the Repeal Martyrs”, from The Freeman’s Journal. (Courtesy of the National Library of Ireland)"},
{"id": "013", "description": " Daniel O’Connell (Courtesy of the National Library of Ireland)"},
{"id": "014", "description": "Daniel O’Connell addressing crowds from the balcony of his home in Merrion Square following his release from The Richmond Bridewell, 6 September 1844. (Courtesy of the National Library of Ireland)"},
{"id": "015", "description": "view of Richmond Bridewell as drawn by Henry O’Neill R.H.A. 1844. (Courtesy of the Christian Brothers, Edmund Rice House)"},
{"id": "016", "description": "the Dining Room, as drawn by Henry O’Neill R.H.A. 1844. (Courtesy of the Christian Brothers, Edmund Rice House)"},
{"id": "017", "description": "the Liberator’s bedroom as drawn by Henry O’Neill R.H.A. 1844. Both rooms display an opulence not usually accorded an inmate of theprison. (Courtesy of the Christian Brothers, Edmund Rice House)"},
{"id": "018", "description": " John O’Connell’s bedroom, Richmond Bridewell, as drawn by Henry O’Neill R.H.A. 1844. Both rooms display an opulence not usually accorded an inmate of theprison.  (Courtesy of the Christian Brothers, Edmund Rice House)"},
{"id": "019", "description": "Section of the Register from the Richmond Bridewell 1845-1849. (Courtesy of the National Archives)"},
{"id": "020", "description": "Section of the Register from the Richmond Bridewell 1845-1849. (Courtesy of the National Archives)"},
{"id": "021", "description": "Famine in Ireland 1845-48. The Richmond Bridewell was filled to twice its capacity during the Famine.  (Courtesy of the National Library of Ireland)"},
{"id": "022", "description": "James Stephens, Fenian leader. (Courtesy of the National Library of Ireland)"},
{"id": "023", "description": "Harper’s Weekly front cover, 7th April 1866. Caption reads:‘Richmond Bridewell, Dublin, from which head-centre Stephens escaped.’"},
{"id": "024", "description": "Joseph Poole. (Courtesy of Robert Delaney)"},
{"id": "025", "description": "A plaque erected to Poole’s memory in Griffith Barracks in 1968."},
{"id": "026", "description": "Wellington Barracks with soldier on guard duty, c.1900.(Courtesy of the National Library of Ireland)"},
{"id": "027", "description": "Wellington Barracks, plan/elevations c. 1900.  (Courtesy of Military Archives, Department of Defence)"},
{"id": "028", "description": "Inside Wellington Barracks, with soldiers on horseback c.1900.  (Courtesy of the National Library of Ireland)"},
{"id": "029", "description": "British Army Parade in Dublin.  (Courtesy of the National Library of Ireland)"},
{"id": "030", "description": "Recruiting posters for the First World War ‘Your First duty is to play your part in ending the war’, John Redmond, 1915.(Courtesy of the National Library of Ireland)"},
{"id": "031", "description": "Recruiting posters for the First World War"},
{"id": "032", "description": "Easter Rising the GPO in ruins. (Courtesy of the National Library of Ireland)"},
{"id": "033", "description": "Con Colbert, the Volunteer officer, who ordered Wellington to be scouted on the outbreak of the Rising. (Courtesy of the National Library of Ireland)"},
{"id": "034", "description": "The burnt out shell of the Linen Hall Barracks. Wellington was not directly attacked but was harassed by sniper fire during the Rising.  (Courtesy of the National Library of Ireland)"},
{"id": "035", "description": "Wellington Barracks from the canal c.1900.  (Courtesy of the National Library of Ireland)"},
{"id": "036", "description": "A civilian, or IRA member, killed after the IRA raid on the Customs House in May 1921.  (Courtesy of the National Library of Ireland)"},
{"id": "037", "description": "‘Good Bye Dublin’ British troops prepare to be shipped out of Dublin. (Courtesy of the National Library of Ireland)"},
{"id": "038", "description": "The building pictured in this watercolour by Aidan Powell was the barracks’ medical centre. It was later used by the Revenue Commissioners to store tax files. "},
{"id": "039", "description": "Free State officers in front of armoured cars. Centre in the front row is Tom Ennis, who commanded the National Army takeover of Wellington Barracks. (Courtesy of the National Library of Ireland)"},
{"id": "040", "description": "British troops being replaced by National Army troops at Richmond Barracks in 1922. Similar scenes took place at Wellington Barracks in April 1922.  (Courtesy of the National Library of Ireland)"},
{"id": "041", "description": "Free State or National Army soldiers parade in Wellington Barracks, in front of the guardhouse in 1922.(Courtesy of the National Library of Ireland)"},
{"id": "042", "description": "Recruits for the National Army enter Wellington Barracks, 1922.  (Courtesy of the National Library of Ireland)"},
{"id": "043", "description": "Artillery outside the Four Courts. (Courtesy of the National Library of Ireland)"},
{"id": "044", "description": "Civil War in Dublin – troops at Nelson’s Pillar.  (Courtesy of the National Library of Ireland)"},
{"id": "045", "description": "The YMCA and other buildings on fire. (Courtesy of the National Library of Ireland)"},
{"id": "046", "description": "Buildings burning at the north end of O’Connell Street,  July 1922.  (Courtesy of the National Library of Ireland)"},
{"id": "047", "description": "Kevin O’Higgins, Minister for Home Affairs.(Courtesy of the National Library of Ireland)"},
{"id": "048", "description": "Crowds gather outside the barracks after the attack. (Courtesy of the National Library of Ireland)"},
{"id": "049", "description": "View of bomb damage on the South Circular Road, January 1941, taken from behind the Griffith Barracks’ railings.(Courtesy of the National Library of Ireland)"},
{"id": "050", "description": "The Irish Army parades in 1933 for the Papal Nuncio’s visit.  (Courtesy of the National Library of Ireland)"},
{"id": "051", "description": "Belongings loaded on a cart, the South Circular Road, January 1941.(Courtesy of the National Library of Ireland)"},
{"id": "052", "description": "Aftermath of the North Strand Bombings, 1941 – troops from Griffith were used in the rescue operation.(Courtesy of the National Library of Ireland)"},
{"id": "053", "description": "Evening Herald, Friday January 3, 1941"},
{"id": "054", "description": "1916 Jubilee Commemorations – parade and ceremonies at the General Post Office, Dublin. President Eamon de Valera,accompanied by Commandant Daniel O’Connell, inspects the Guard of Honour at the G.P.O. prior to the Military Parade. The Guard of Honour was furnished by the 20th Infantry Battalion from Griffith Barracks which were led from the barracks to O’Connell Street by Col. Ned Cusack. (Courtesy of the Irish Photo Archive)"},
{"id": "055", "description": "The last Irish Army parade in Griffith Barracks on September 15th,1988. The inspecting officers are Brigadier General Monahan, General Officer Commanding of the Eastern Command, escorted by Comandants McCann and Whelan and Captain Hynes, all of the Cavalry Squadron.(Courtesy of An Cosantóir, ‘Farewell to Griffith’, September 1988)"},
{"id": "056", "description": "Arthur Griffith departing for London from Dun Laoghaire for the Treaty Conference, 1921.(Courtesy of the National Library of Ireland)"},
{"id": "057", "description": "Arthur Griffith"},
{"id": "058", "description": "Griffith and De Valera with other Treaty Plenipotentiaries on board the boat to England. (Courtesy of the National Library of Ireland)"},
{"id": "059", "description": "Arthur Griffith chatting to soldiers and civilians, c. 1922. (Courtesy of the National Library of Ireland)"},
{"id": "060", "description": "Griffith, Barton and Collins, December 1921.(Courtesy of the National Library of Ireland)"},
{"id": "061", "description": "Aerial view of Griffith College as it is today."},
{"id": "063", "description": "Directors of Griffith College, Pierce Kent, Professor Diarmuid Hegarty and Reg Callanan pictured after the purchase of the barracks."},
{"id": "064", "description": "The Conference Centre and Halls of Residence"},
{"id": "065", "description": "From left Lord Mayor Gay Mitchell, Shane Gray, Grandson of Arthur Griffith, Ita Gray, Daughter of Arthur Griffith and Diarmuid Hegarty President of Griffith College on the occasion of the announcement of the Griffith Scholarships on the 12th of August 1992."},
{"id": "066", "description": "View of the campus college green, c. 2000."},
{"id": "067", "description": "Business Expansion Scheme Proposal 1993."},
{"id": "068", "description": "President Mary Robinson officially launching the Conservation Volunteer Ireland Urban Project at Griffith College in April 1993.(Image courtesy of the Irish Farmers Journal)"},
{"id": "069", "description": "Former Griffith Barracks personnel meet with Prof. Diarmuid Hegarty on a visit to the campus in May 1995. Pictured (l-r)"},
{"id": "070", "description": "The Griffith College Halls of Residence which were built to complement the original buildings."},
{"id": "071", "description": "Seamus Heaney MRIA Poet & Nobel Laureate Distinguished Fellow 2012"},
{"id": "072", "description": "Peter Sutherland KCMG, SC Attorney General & EU Commissioner Distinguished Fellow 2011"},
{"id": "073", "description": "Catherine Day Sec. General of the EU Commission Distinguished Fellow 2010"},
{"id": "074", "description": "Diljit Rana, Baron Rana, MBE Member of House of Lords Distinguished Fellow 2009"},
{"id": "075", "description": "Denis O’Brien, MBA Chairman, Communicorp Group Ltd Distinguished Fellow 2008"},
{"id": "076", "description": "The Hon. Mrs Justice Susan Denham Chief Justice of Ireland Distinguished Fellow 2013"},
{"id": "077", "description": "Mary McAleese President of Ireland Distinguished Fellow 2007"},
{"id": "078", "description": "John Hume, KCSG Nobel Peace Laureate Distinguished Fellow 2006"},
{"id": "079", "description": "Martin Naughton Founder & Chairman,Glen Dimplex Group Distinguished Fellow 2006"},
{"id": "080", "description": "Gillian Bowler Founder, Budget Travel & Chairman, Failte Ireland Distinguished Fellow 2005"},
{"id": "081", "description": "Edward Haughey, Baron Ballyedmond, OBE Member Seanad Eireann and House of Lords Founder & Chairman, Norbrook Laboratories Distinguished Fellow 2004"},
{"id": "082", "description": "Griffith College Limerick."},
{"id": "083", "description": "Griffith College Cork."}
]
